load-testing/basic-load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 50
      name: "Load phase"
    - duration: 60
      arrivalRate: 100
      name: "Peak load phase"
    - duration: 60
      arrivalRate: 10
      name: "Cool down phase"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Dashboard load test"
    weight: 40
    flow:
      - get:
          url: "/dashboard"
          expect:
            - statusCode: 200
      - think: 2

  - name: "Projects page load test"
    weight: 30
    flow:
      - get:
          url: "/projects"
          expect:
            - statusCode: 200
      - think: 3
      - get:
          url: "/api/v1/projects"
          expect:
            - statusCode: 200

  - name: "API endpoints test"
    weight: 20
    flow:
      - get:
          url: "/api/v1/dashboard/stats"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/v1/profile"
          expect:
            - statusCode: 200

  - name: "Static assets test"
    weight: 10
    flow:
      - get:
          url: "/_next/static/css/app.css"
          expect:
            - statusCode: 200
      - get:
          url: "/_next/static/chunks/main.js"
          expect:
            - statusCode: 200